zswan/linux/arch/arm/mach-w90x900/include/mach/nuc970-regs-aic.h
/*
 * Copyright 2016 Wan Zongshun <mcuos.com@gmail.com>
 *
 * The code contained herein is licensed under the GNU General Public
 * License. You may obtain a copy of the GNU General Public License
 * Version 2 or later at the following locations:
 *
 * http://www.opensource.org/licenses/gpl-license.html
 * http://www.gnu.org/copyleft/gpl.html
 */

#ifndef __ASM_ARCH_REGS_AIC_H
#define __ASM_ARCH_REGS_AIC_H

/*NUC970 AIC regs*/

#define	REG_AIC_SCR1	0x00
#define	REG_AIC_SCR2	0x04
#define	REG_AIC_SCR3	0x08
#define	REG_AIC_SCR4	0x0C
#define	REG_AIC_SCR5	0x10
#define	REG_AIC_SCR6	0x14
#define	REG_AIC_SCR7	0x18
#define	REG_AIC_SCR8	0x1C
#define	REG_AIC_SCR9	0x20
#define	REG_AIC_SCR10	0x24
#define	REG_AIC_SCR11	0x28
#define	REG_AIC_SCR12	0x2C
#define	REG_AIC_SCR13	0x30
#define	REG_AIC_SCR14	0x34
#define	REG_AIC_SCR15	0x38
#define	REG_AIC_IRSR	0x100
#define	REG_AIC_IRSRH	0x104
#define	REG_AIC_IASR	0x108
#define	REG_AIC_IASRH	0x10C
#define	REG_AIC_ISR	0x110
#define	REG_AIC_ISRH	0x114
#define	REG_AIC_IPER	0x118
#define	REG_AIC_ISNR	0x120
#define	REG_AIC_OISR	0x124
#define	REG_AIC_IMR	0x128
#define	REG_AIC_IMRH	0x12C
#define	REG_AIC_MECR	0x130
#define	REG_AIC_MECRH	0x134
#define	REG_AIC_MDCR	0x138
#define	REG_AIC_MDCRH	0x13C
#define	REG_AIC_SSCR	0x140
#define	REG_AIC_SSCRH	0x144
#define	REG_AIC_SCCR	0x148
#define	REG_AIC_SCCRH	0x14C
#define	REG_AIC_EOSCR	0x150

#endif /*  __ASM_ARCH_REGS_AIC_H */
